buttons = \
    {
    'download_128': "📥 MP3 (128 kb/s)",
    'download_192': "📥 MP3 (192 kb/s)",
    'download_256': "📥 MP3 (256 kb/s)",
    'download_320': "📥 MP3 (320 kb/s)",
    }
messages = {
    'wait': "Ваш запыт апрацоўваецца, чакайце калі-ласка. Час адказа бота залежыць ад памеру відэа-файла"
    }

exceptions = {
    'audio_sent': "Памылка пры адпраўленні файла ў telegram"
}
commands_text = {
    'help': '👉 Адпраўце боту спасылку на відэа YouTube. Дачакайцеся адказу.\n\n' +
            '👉 Абярыце якасць і націсніце на адпаведную кнопку:\n' +
            '⇨ 128 kb/s - пачатковы узровень якасці музыкі\n' +
            '⇨ 192 kb/s - прымальная (сярэдняя) якасць музыкі\n' +
            '⇨ 256 kb/s - высокая якасць музыкі\n' +
            '⇨ 320 kb/s - наівышэйшая якасць музыкі\n' +
            '❕ Падчас выбару якасці памятайце аб тым, што чым вышэй якасць, тым больш часу патрабуецца боту для апрацоўкі запыта\n\n'
            '👉 Дачакайцеся адказа бота\n' +
            '❕ Калі бот не адказвае больш за некалькі хвілін - гэта сведчыць аб непрадугледжанай памылке, для якой не быў створаны адпаведны апрацоўшчык. Паспрабуйче змяніць спасылку на выдэа YouTube.\n' +
            '❕ Калі бот не адказвае на любыя каманды, гэта сведчыць аб адключэнні сервера. Пачакайце некаторы час (дзень ці два) і паспрабуйце зноў =)\n'
            + 
            '<a href="https://github.com/Dm-Rb/youtube2mp3_convet_tg_bot">🔗 GitHub</a>'
            ,

    'start': 'Адпраўце боту спасылку на відэа YouTube. Бот cканвертуе відэа ў mp3-файл.'
}

download_errors = {
    'age_limit': "‼️ <i>Гэтае відэа мае ўзроставае абмежаванне 18+. Youtube патрабуе аутэнтыфікацыі, спампоўка немагчыма</i> 🤷🏻‍♂️\n\n"
                 "<i>This video is rated 18+. Youtube requires authentication, download is not possible</i>"}

def youtube_metadata_message(metadata: dict):
    if metadata['view_count']:
        views = " ".join(str(metadata['view_count'])[::-1][i:i + 3] for i in range(0, len(str(metadata['view_count'])), 3))[::-1]
    else:
        views = 'Няма інфармацыі'
    if metadata['duration']:
        h, m, s = int(metadata['duration']) // 3600, (int(metadata['duration']) % 3600) // 60, int(metadata['duration']) % 60
        duration = f"{h:02}:{m:02}:{s:02}"
    else:
        duration = 'Няма інфармацыі'

    message = (f"⇨ <b>Назва:</b> {metadata['title']}\n"
                f"⇨ <b>Канал:</b> {metadata['uploader']}\n"
                f"⇨ <b>Працягласць відэа:</b> {duration}\n"
                f"⇨ <b>Колькасць праглядаў:</b> {views}\n"
               )

    return message

